hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/donating/cdm/v1/ErrorService_01/ERROR_MSG.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:handleError xmlns:ns2="http://www.mnet.de/esb/cdm/Shared/ErrorHandlingService/v1">
            <ns2:trackingId>Track123</ns2:trackingId>
            <ns2:component>
                <ns2:name>Hurrican</ns2:name>
                <ns2:processName>de.mnet.wbci.service.impl.WbciSchemaValidationServiceImpl</ns2:processName>
                <ns2:host>@ignore@</ns2:host>
                <ns2:service>CarrierNegotiationService</ns2:service>
                <ns2:operation>requestCarrierChange</ns2:operation>
                <ns2:processId>@ignore@</ns2:processId>
            </ns2:component>
            <ns2:error>
                <ns2:code>WBCI_TECH_1003</ns2:code>
                <ns2:message>Invalid WBCI message content - schema validation failed</ns2:message>
                <ns2:time>@ignore@</ns2:time>
                <ns2:errorDetails>@ignore@</ns2:errorDetails>
            </ns2:error>
            <ns2:message>
                <ns2:payload>&lt;?xml version='1.0' encoding='UTF-8'?&gt;&#xd;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"&gt;&#xd;
    &lt;SOAP-ENV:Header/&gt;&#xd;
    &lt;SOAP-ENV:Body&gt;&#xd;
        &lt;v1:requestCarrierChange xmlns:v1="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1"&gt;&#xd;
            &lt;v1:VA-KUE-MRN&gt;&#xd;
                &lt;aaa /&gt;&#xd;
            &lt;/v1:VA-KUE-MRN&gt;&#xd;
        &lt;/v1:requestCarrierChange&gt;&#xd;
    &lt;/SOAP-ENV:Body&gt;&#xd;
&lt;/SOAP-ENV:Envelope&gt;</ns2:payload>
                <ns2:JMSEndpoint>mnet.Hurrican.op.cdm.dst.v1.CarrierNegotiationService</ns2:JMSEndpoint>
                <ns2:JMSProperty>
                    <ns2:key>ESB_TrackingId</ns2:key>
                    <ns2:value>Track123</ns2:value>
                </ns2:JMSProperty>
                <ns2:JMSProperty>
                    <ns2:key>SoapAction</ns2:key>
                    <ns2:value>/CarrierNegotiationService/requestCarrierChange</ns2:value>
                </ns2:JMSProperty>
                <ns2:JMSProperty>
                    <ns2:key>timestamp</ns2:key>
                    <ns2:value>@ignore@</ns2:value>
                </ns2:JMSProperty>
            </ns2:message>
        </ns2:handleError>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>