hurrican/hurrican-acceptance-test/src/citrus/resources/templates/customer/v1/GetOrderDetailsCustomer_02/errorNotification.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <ns2:handleError xmlns:ns2="http://www.mnet.de/esb/cdm/Shared/ErrorHandlingService/v1">
            <ns2:trackingId>@ignore@</ns2:trackingId>
            <ns2:component>
                <ns2:name>Hurrican</ns2:name>
                <ns2:processName>de.augustakom.hurrican.service.interceptor.SchemaValidationInterceptor</ns2:processName>
                <ns2:host>@ignore@</ns2:host>
                <ns2:service>CustomerOrderService</ns2:service>
                <ns2:operation>getOrderDetails</ns2:operation>
                <ns2:processId>@ignore@</ns2:processId>
            </ns2:component>
            <ns2:error>
                <ns2:code>HURRICAN-TECH-009</ns2:code>
                <ns2:message>@contains('Element "lineContractId" ist Simple Type')@</ns2:message>
                <ns2:time>@ignore@</ns2:time>
                <ns2:errorDetails>@ignore@</ns2:errorDetails>
            </ns2:error>
            <ns2:message>
                <ns2:payload>citrus:cdataSection('@matchesXml('
                    <?xml version='1.0' encoding='UTF-8'?>
                    <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
                        <SOAP-ENV:Body>
                            <getOrderDetails
                                    xmlns="http://www.mnet.de/esb/cdm/Customer/CustomerOrderService/v1">
                                @ignore@
                            </getOrderDetails>
                        </SOAP-ENV:Body>
                    </SOAP-ENV:Envelope>
                    ')@')
                </ns2:payload>
                <ns2:JMSEndpoint>mnet.Hurrican.op.cdm.dst.v1.CustomerOrderService</ns2:JMSEndpoint>
                <ns2:JMSProperty>
                    <ns2:key>ESB_TrackingId</ns2:key>
                    <ns2:value>@ignore@</ns2:value>
                </ns2:JMSProperty>
                <ns2:JMSProperty>
                    <ns2:key>SoapAction</ns2:key>
                    <ns2:value>/CustomerOrderService/getOrderDetails</ns2:value>
                </ns2:JMSProperty>
                <ns2:JMSProperty>
                    <ns2:key>timestamp</ns2:key>
                    <ns2:value>@ignore@</ns2:value>
                </ns2:JMSProperty>
            </ns2:message>
        </ns2:handleError>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>